app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "MyString"], ["body", "MyText"], ["created_at", 2016-08-18 10:07:01 UTC], ["updated_at", 2016-08-18 10:07:01 UTC]]
---
  def create
    @question = Question.new(question_params)
    @question.user = current_user
    if @question.save

UPDATE "questions" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "new title"], ["body", "new body"], ["updated_at", 2016-08-18 10:07:01 UTC], ["id", 11]]
---
  def update
    if @question.update(question_params)

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 15]]
---
  def destroy
    if current_user.author_of?(@question)
      @question.destroy

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def load_question
    @question = Question.find(params[:id])